#!/usr/bin/python
# -*- coding: UTF-8 -*-
"""
用户设置文件

"""

# 配置部分开始
debug = False  # 是否开启调试日志输出  开=True  关=False

# 目录需要事先手动建立好，不然程序会出错
tdx = {
    'tdx_path': 'c:/zd_zsone',  # 指定通达信目录  tdx_day_file_path = 'C:\\zd_zsone\\vipdoc\\'

    #下面是元代码，后面根据实际修改
    'csv_lday': 'd:/TDXdata/lday_qfq',  # 指定csv格式日线数据保存目录
    'pickle': 'd:/TDXdata/pickle',  # 指定pickle格式日线数据保存目录
    'csv_index': 'd:/TDXdata/index',  # 指定指数保存目录
    'csv_cw': 'd:/TDXdata/cw',  # 指定专业财务保存目录
    'csv_gbbq': 'd:/TDXdata',  # 指定股本变迁保存目录
    'pytdx_ip': '218.6.170.55',  # 指定pytdx的通达信服务器IP
    'pytdx_port': 7709,  # 指定pytdx的通达信服务器端口。int类型
}

# 将来这里放我的股票池
my_stocks_list = [  # 通达信需要转换的指数文件。通达信按998查看重要指数
    #'999999',  # 上证指数
    #'000300',  # 沪深300
    #'399001',  # 深成指
    '300215', # 电科院
    '301246', # 宏源药业
    '300497', # 福祥药业
    '300251', # 光线传媒
    '000686', # 东北证券
    '600526', # 菲达环保
    '600158', # 中体产业
    '600959', # 江苏有线
    '002218', # 拓日新能
    '000807', # 云铝股份
    '600475', # 华光环能
    '000807', # 云铝股份
    '600143', # 金发科技
    '601006', # 大秦铁路
    '600233', # 圆通速递
    '600745', # 闻泰科技
    '002852', # 道道全
    '002303', # 美盈森
]

my_stocks_html_folder_name = 'mystockshtml'

#行业板块 > 能源金属 https://quote.eastmoney.com/center/gridlist.html#boards2-90.BK1015
neng_yuan_list = [
'002738', # 中矿资源
'300390', # 天华新能
'002192', # 融捷股份
'002466', # 天齐锂业
'600711', # 盛屯矿业
'002460', # 赣锋锂业
'002240', # 盛新锂能
'301219', # 腾远钴业
'000762', # 西藏矿业
'300618', # 寒锐钴业
'002667', # 威领股份
'603799', # 华友钴业
'002340', # 格林美

]

#行业资金流向 > 有色金属 https://data.eastmoney.com/bkzj/BK0478.html 铜业
you_se_list = [
'600362', # 江西铜业
'601899', # 紫金矿业
'000630', # 铜陵有色
'000737', # 北方铜业
'603978', # 深圳新星
'000878', # 云南铜业
'601600', # 中国铝业
'600219', # 南山铝业
'601212', # 白银有色
'002578', # 闽发铝业
'600338', # 西藏珠峰
'000933', # 神火股份
'000688', # 国城矿业
'600531', # 豫光金铅
'002824', # 和胜股份
'000758', # 中色股份
'603876', # 鼎胜新材
'000603', # 盛达资源
'002501', # 利源股份
'600331', # 宏达股份
'000060', # 中金岭南
'300697', # 电工合金
'002182', # 宝武镁业
'002160', # 常铝股份
'601677', # 明泰铝业
'002978', # 安宁股份
'601388', # 怡球资源
'000751', # 锌业股份
]

#行业资金流向 > 半导体
ban_dao_ti_list = [
	'001309', # 德明利
	'603986', # 兆易创新
	'688605', # 先锋精科
	'301308', # 江波龙
	'688270', # 臻镭科技
	'002049', # 紫光国微
	'688449', # 联芸科技
	'688720', # 艾森股份
	'688141', # 杰华特
	'603501', # 豪威集团
	'002213', # 大为股份
	'688213', # 思特威-W
	'688256', # 寒武纪-U
	'688110', # 东芯股份
	'688209', # 英集芯
	'688766', # 普冉股份
	'688233', # 神工股份
	'600641', # 先导基电
	'600877', # 电科芯片
	'688661', # 和林微纳
	'688172', # 燕东微
	'688380', # 中微半导
	'688691', # 灿芯股份
	'25688002', # 睿创微纳
	'688486', # 龙迅股份
	'688262', # 国芯科技
	'301678', # 新恒汇
	'688279', # 峰岹科技
	'301369', # 联动科技
    '300672', # 国科微
	'688508', # 芯朋微
	'688049', # 炬芯科技
	'688135', # 利扬芯片
	'688391', # 钜泉科技
	'605588', # 冠石科技
    '301095', # 广立微
	'688325', # 赛微微电	
	'688512', # 慧智微-U	
	'688693', # 铬威特	
	'688530', # 欧莱新材	
	'688107', # 安路科技	
'603324', # 盛剑科技	
'301348', # 蓝箭电子
'688620', # 安凯微	
'300831', # 派瑞股份	
'603160', # 汇顶科技	
'688721', # 龙图光罩	
'688699', # 明微电子	
'688689', # 银河微电	
]
# 配置部分结束
